I = [3, 1, 5, 4, 2]
I.sort()  #由小到大
print(I)

I = [3, 1, 5, 4, 2]
I.sort(reverse=True)  #由大到小
print(I)

I = [3, 1, 4, 2, 5]
I.reverse()  #整個字串顛倒
print(I)

I = ["a", "b", "c", "a"]
print(I.index("a"))  #找出a在哪

#字典資料型態
#保存鍵與值資料
#可以改
#用{}表示 用逗號隔開 用分號:表示鍵與值

{"大便": "排泄物", "智障": "啟智兒"}
#  鍵      值      鍵      值

{}
{"大便": "排泄物"}
{1: "排泄物", 2: "啟智兒"}

#取得key對應數值
B = {"書名": "天堂之門", "作者": "岸邊露伴"}
B["書名"]
B["作者"]

F = {"承太郎": "白金之星", "朱柏翰": "天才", "仕奇": "啟智兒"}
for W in F:
    print(F[W])

d = {"承太郎": "白金之星", "朱柏翰": "天才", "仕奇": "啟智兒"}
K = d.K()
for key in K:
    print("key")