'''
print(
    "白金之星-世界!歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉歐拉"
)
'''
'''
A = "歐拉!"
A = A * 75
print("白金之星-世界!%s", A)
'''
'''
try:
    a = int(input('請請輸入一個數字'))
    total = a + 1
    print(total)
except:
    print(
        '阿不是叫你打數字嗎?你看不懂中文嗎?大傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!傻逼!'
    )
'''
'''
==:相等;1==1 True
!=:不相等;1!=2 True
>=:大於等於;1>=8 False
<=:小於等於;9<=8 False
>=大於;1>2 False
<=小於;2<1 False
'''
1 == 1
